-- 請練習撰寫底下指令 : 使用 Northwind.Customer 客戶資料表

-- Step 01 打開 Northwind 資料庫 



-- Step 02 從dbo.Customers table 中, 挑選 所有 客戶欄位 資料




-- Step 03 挑選 所有 客戶欄位 資料，並用 "城市" 排序




-- Step 04 挑選 客戶 資料中指定欄位：客戶代號, 公司名稱, 聯絡人姓名, 聯絡電話



-- Step 05 延續上題，請將欄位名稱分別改成以中文 客戶編號, 公司名稱, 聯絡人, 連絡電話顯示




-- Step 06  挑選 客戶資料中指定欄位：客戶編號, 公司名稱, 聯絡人, 連絡電話
--					挑選出 城市國家是 "德國" 資料列






-- Step 07 承上題  
--					在語法查詢中建立一欄位 ( 國家 +' / '+城市) 並欄位名稱給與別名 '國家 +' / '+城市 '
--					同時加入 國家墨西哥, 英國資料列




-- Step 08 承上題  加入包含 客戶編號 中包含 AN 的資料






-- Step 09  承 Step 07  並依照 國家(大到小),  城市(小到大) 排序











